Merge pull request #6 from Harsh63870/Harsh63870-patch-1
Revise README for clarity and updated information
